Revit 2027 API
PointCloudOverrideSettings Methods
The PointCloudOverrideSettings type exposes the following members.
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetModeOverride |  Lookup color settings for the given color mode.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Checks if the contents of two settings are equal.
SetModeOverride |  Sets color settings for the given color mode.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace